{
    "fr-CA": "Français",
    "en-CA": "English",

    "About": "À propos",
    "Music": "Musique",
    "Computer science": "Informatique",
    "Contact": "Contact",

    "about-desc": "La guitare, la pédagogie et la programmation; ce sont mes trois passions qui m'ont guidé jusqu'à aujourd'hui.",
    "about-1": "J'ai complété, en 2018, mon baccalauréat avec mention d'honneur de la doyenne en interprétation jazz/pop, puis j'ai poursuivi à la maitrise en didactique instrumentale que j'ai complétée en 2021. Mon sujet : L’improvisation comme moteur d’apprentissage chez les jeunes guitaristes.",
    "about-2": "J'ai commencé à enseigner la musique pendant mon baccalauréat en interprétation. L'enseignement est un domaine que j'aime encore énormément, si vous cherchez un professeur de guitare ou d'improvisation musicale, n'hésitez pas à me",
    "contact-me": "me contacter",
    "about-3": "Mes études au deuxième cycle m'ont initié au monde de la recherche académique. J'y suis encore actif à titre de professionnel de recherche pour Jean-Philippe Després (Ph. D.), à l'Université Laval, dans le cadre de son projet de recherche-développement de matériel pédagogique ludique pour soutenir l'apprentissage de l'improvisation musicale.",
    "about-4": "En complétant ma maitrise, je me suis aussi enrôlé dans les Forces armées canadiennes comme musicien pour le NCSM Montcalm, une division de la réserve navale située à Québec. Aujourd'hui, je suis principalement actif avec la Musique nationale de la Réserve navale tout en étant présent pour les répétitions et les engagements de la Musique du NCSM Montcalm.",
    "about-5": "En finissant ma maitrise en didactique instrumentale, la COVID-19 est arrivée et a complètement perturbé le projet de recherche dans lequel je travaillais. Impossible de faire tester le jeu d'improvisation musicale analogique à des participants qui ne se voient désormais plus qu'en ligne. C'est sous cette nouvelle réalité que j'ai migré le jeu de table développé pendant le projet de recherche vers",
    "about-6": ". Ce qui nous a permis de continuer le projet, et m'a fait faire le bond en informatique.",
    "about-7": "Pour accroitre mes connaissances dans le domaine, je me suis inscrit au certificat en informatique de l'Université Laval. Avec mon emploi avec la Musique nationale de la Réserve navale et le projet de recherche de Jean-Philippe Després, je complète ma formation au ralenti, mais elle m'a permis d'acquérir plusieurs compétences importantes dans le domaine.",
    "completed-courses": "Cours complétés :",
    "python": "Introduction à la programmation avec Python",
    "cpp": "Programmation avancée en C++",
    "osa": "Ordinateurs : structure et applications",
    "algo": "Algorithmes et structures de données",
    "about-8": "Actuellement, ce qui m'intéresse le plus, c'est le développement web. Malgré qu'aucun de mes cours de certificats ne m'ait initié à ce domaine, c'est là où j'ai réalisé la majorité de",
    "my-projects": "mes projets",

    "music-desc": "Je suis musicien à Québec depuis plus de 14 ans, diplômé du baccalauréat en interprétation jazz/pop et de la maitrise en didactique instrumentale de la Faculté de musique de l'Université Laval.",
    "need-musician": "Besoin d'un musicien ou d'un groupe pour votre évènement?",
    "contact": "Contactez-moi",
    "sheet-music-download": "Partitions à télécharger",
    "master-recital": "Récital de fin de maitrise",
    "nbnr": "Musique nationale de la Réserve navale",
    "music-downloads": "Transcriptions, exercices et autres partitions",
    "need-a-teacher": "Cherchez-vous un professeur de guitare pour apprendre les pièces suivantes?",
    "transcription-desc": "J'ai fait de nombreuses transcriptions pendant mes études en musique, en voici quelques-unes, n'hésitez pas à les télécharger et à les jouer!",
    "exercices-desc": "Voici quelques exercices qui m'ont bien été utiles comme échauffement et pour pratiquer ma technique instrumentale à la guitare.",
    "exercice-sweep": "Sweep de triades sur Tune Up",
    "exercice-arpegios": "Exercices d'argèges 7",
    "exercice-neck-hand": "Exercice pour main du manche",
    "compo-title": "Compositions et arrangements",
    "compo-desc": "Si vous souhaitez apprendre mes compositions ou mes arrangements que vous avez pu entendre sur cette page, les voici!"
}
