{
  "fr": "Français",
  "en": "English",

  "index-desc": "Jean-Michel Viel, musicien, pédagogue et programmeur.",

    "about-url": "a-propos",
    "music-url": "musique",
    "computer-science-url": "informatique",
  "games-url": "jeux",

    "Home" : "Accueil",
    "About": "À propos",
    "Music": "Musique",
    "Computer Science": "Informatique",
  "Games": "Jeux",
  "Contact": "Contact",

  "about-desc": "La guitare, la pédagogie et la programmation; ce sont mes trois passions qui m'ont guidé jusqu'à aujourd'hui.",
  "where-I-Am": "Où j'en suis",
  "where-I-Am-1": "Je suis actuellement développeur pour la société ",
  "where-I-Am-2": ". Spécialisé en frontend et en création de jeu pour leur filiale ",
  "where-I-Am-3": ", j'ai aussi été un des développeurs principaux pour la collection d'applications web ",
  "my-background": "J'ai un parcours un peu atypique, j'en conviens. Le voici :",
  "about-1": "J'ai complété, en 2018, mon baccalauréat avec mention d'honneur de la doyenne en interprétation jazz/pop, puis j'ai poursuivi à la maitrise en didactique instrumentale que j'ai complétée en 2021. Mon sujet : L’improvisation comme moteur d’apprentissage chez les jeunes guitaristes.",
  "about-2": "J'ai commencé à enseigner la musique pendant mon baccalauréat en interprétation. L'enseignement est un domaine que j'aime encore énormément, si vous cherchez un professeur de guitare ou d'improvisation musicale, n'hésitez pas à me",
  "contact-me": "me contacter",
  "about-3": "Mes études au deuxième cycle m'ont initié au monde de la recherche académique. J'y suis encore actif à titre de professionnel de recherche pour Jean-Philippe Després (Ph. D.), à l'Université Laval, dans le cadre de son projet de recherche-développement de matériel pédagogique ludique pour soutenir l'apprentissage de l'improvisation musicale.",
  "about-4": "En complétant ma maitrise, je me suis aussi enrôlé dans les Forces armées canadiennes comme musicien pour le NCSM Montcalm, une division de la réserve navale située à Québec. En plus d'être présent pour les répétitions et les engagements de la Musique du NCSM Montcalm, j'ai été membre actif de la Musique nationale de la Réserve navale. Aujourd'hui, j'ai pris une pause de mon engagement dans la Réserve pour me concentrer sur mon traval actuel de développeur web chez ÉduMedia et passer plus de temps avec ma famille que j'adore.",
  "about-5": "En finissant ma maitrise en didactique instrumentale, la COVID-19 est arrivée et a complètement perturbé le projet de recherche dans lequel je travaillais. Impossible de faire tester le jeu d'improvisation musicale analogique à des participants qui ne se voient désormais plus qu'en ligne. C'est sous cette nouvelle réalité que j'ai migré le jeu de table développé pendant le projet de recherche vers",
  "about-6": ". Ce qui nous a permis de continuer le projet, et m'a fait faire le bond en informatique.",
  "about-7": "Pour accroitre mes connaissances dans le domaine, je me suis inscrit au certificat en informatique de l'Université Laval. Avec mon emploi avec la Musique nationale de la Réserve navale et le projet de recherche de Jean-Philippe Després, je n'ai complèté que quelque cours, mais ils m'ont permis d'acquérir plusieurs compétences importantes dans le domaine.",
  "completed-courses": "Cours complétés :",
  "python": "Introduction à la programmation avec Python",
  "cpp": "Programmation avancée en C++",
  "osa": "Ordinateurs : structure et applications",
  "algo": "Algorithmes et structures de données",
  "about-8": "L'évènement marquant de mon certificat en informatique a été l'obtention d'un stage chez ÉduMedia. Par la suite, j'ai eu la chance d'être engagé comme développeur à temps plein. Quand j'ai du temps libre, je le passe sur ",
  "my-projects": "mes projets",

  "music-desc": "Je suis musicien à Québec depuis plus de 14 ans, diplômé du baccalauréat en interprétation jazz/pop et de la maitrise en didactique instrumentale de la Faculté de musique de l'Université Laval.",
  "need-musician": "Besoin d'un musicien ou d'un groupe pour votre évènement?",
  "contact": "Contactez-moi",
  "sheet-music-download": "Partitions à télécharger",
  "master-recital": "Récital de fin de maitrise",
  "solo-guitar": "Guitare solo",
  "nbnr": "Musique nationale de la Réserve navale",
  "music-downloads": "Transcriptions, exercices et autres partitions",
  "need-a-teacher": "Cherchez-vous un professeur de guitare pour apprendre les pièces suivantes?",
  "transcription-desc": "J'ai fait de nombreuses transcriptions pendant mes études en musique, en voici quelques-unes, n'hésitez pas à les télécharger et à les jouer!",
  "exercices-desc": "Voici quelques exercices qui m'ont bien été utiles comme échauffement et pour pratiquer ma technique instrumentale à la guitare.",
  "exercice-sweep": "Sweep de triades sur Tune Up",
  "exercice-arpeggio": "Exercices d'argèges 7",
  "exercice-neck-hand": "Exercice pour main du manche",
  "compo-title": "Compositions et arrangements",
  "compo-desc": "Si vous souhaitez apprendre mes compositions ou mes arrangements que vous avez pu entendre sur cette page, les voici!",

  "info-desc": "Spécialisé en développement web, j'aime aussi le développement de jeux vidéos et de programmes utilitaires.",
  "work": "Je travaille comme développeur chez ",
  "work-2": ", ainsi que leur filiale ",
  "web-dev": "Développement web",
  "lbf-1": "Laurence bf est une orthopédagogue spécialisée en difficultés d’apprentissage en français (lecture/écriture) auprès d’enfants de tous âges. Comme elle a le désir d’aider le plus d’enfants possible à développer leurs compétences littéraciques (lecture-écriture),",
  "lbf-2": "elle a décidé de créer l’espace Laurence bf, orthopédagogue",
  "lbf-3": " pour rejoindre les parents, les acteurs les plus importants dans la vie des enfants.",
  "lbf-4": " Son but est de soutenir et d’aider les parents qui se questionnent sur les façons d’intervenir auprès de leur enfant qui rencontre des difficultés en français.",
  "nbnr-1": "La Musique nationale de la Réserve navale (MNRN), formée en 1976, est composée de musiciens réservistes choisis parmi les six divisions de la Réserve navale du Canada ayant une musique.",
  "nbnr-2": "La MNRN s’entraine et se produit principalement pendant l’été afin d’appuyer la mission de la Réserve navale qui est de représenter les Forces armées canadiennes et de créer des liens avec les Canadiens.",
  "improvison-1": "Improvison est un projet de recherche développement dirigé par Jean-Philippe Després (Ph. D.) qui vise à développer du matériel pédagogique basé sur les principes de l’apprentissage par le jeu afin de faciliter l’acquisition, chez les instrumentistes de niveau débutant ou intermédiaire, de stratégies d’",
  "improvison-2": "improvisation musicale",
  "improvison-3": "qui sont mises en œuvre par les experts du domaine et à documenter les impacts perçus de ce matériel.",
  "cafe-social-1": "Réseau social personnel à petite échelle pour le partage de grains de café, de recettes, de trucs et astuces, etc.",
  "cafe-social-2": "Projet en développement.",
  "this-website-title": "Jean-Michel Viel, musicien, pédagogue et programmeur",
  "this-website": "Ce site web!",
  "remplismonordidebits-title": "Remplis mon ordi de bits",
  "remplismonordidebits": "Application web démontrant la possible nécessité de réguler IndexedDB. ",
  "remplismonordidebits-2": "Ce site remplit automatiquement votre disque dur de données impertinentes, n'oubliez pas de videz votre cache!",
  "hrc-title": "Reconnaissance des caractères manuscrits",
  "hrc-description": "Développé avec mes collègues chez EduMedia pour reconnaitre les nombres et les caractères <, > et = dessinés sur un canvas dans une application web pour travailler les mathématiques. L’algorithme peut en théorie reconnaitre n’importe quel caractère qui est contenu dans son jeu de données.",

  "video-games-title": "Jeux vidéos",
  "video-games-desc": "Dans le cadre du projet de recherche-développement Improvison, dirigé par Jean-Philippe Després (Ph. D.), j'ai créé le jeu au cœur de la recherche avec Roblox.",
  "dev-pikado": "J'ai été un des développeurs principaux pour Pikado. Une collection d'applications web qui facilite le quotidien des enseignants du primaire.",
  "dev-alec": "Je développe aussi des jeux éducatifs pour leur filiale ",

  "skills": "Compétences :",

  "contact-desc": "Contactez-moi en remplissant ce formulaire ou en m'envoyant un courriel à",
  "contact-desc-head": "Contact me by filling in this form or by sending an e-mail to info@jeanmichelviel.ca",
  "name": "Nom",
  "email": "Courriel",
  "need": "Votre besoin",
  "select": "-- Selectionnez --",
  "musician": "Musicien",
  "teacher": "Professeur",
  "web-developper": "Développeur web",
  "programmer": "Programmeur",
  "message": "Message",
  "send": "Envoyer",
  "modal-title": "Merci!",
  "modal-desc": "Votre message a été envoyé avec succès. Je vous répondrai dans les plus brefs délais.",
  "modal-close": "Fermer",

  "games-title" : "Jeux",
  "games-desc" : "Collection de petits jeux inspirés de ma vie de père."
}
