{
  "fr": "Français",
  "en": "English",

  "index-desc": "Jean-Michel Viel, musician, educator and programmer.",

  "about-url": "about",
  "music-url": "music",
  "computer-science-url": "computer-science",

  "Home": "Home",
  "About": "About",
  "Music": "Music",
  "Computer Science": "Computer Science",
  "Contact": "Contact",

  "about-desc": "Guitar, teaching and programming; these are my three passions that have guided me to this day.",
  "where-I-Am": "Where I am",
  "where-I-Am-1": "I am currently a developer at ",
  "where-I-Am-2": ". Specialized in frontend and in game development for their branch ",
  "where-I-Am-3": ", I was also one of the main developers for the collection of web apps ",
  "my-background": "I have a rather atypical background, I admit. Here it is:",
  "about-1": "In 2018, I completed my bachelor's degree with the Dean's Honors in jazz/pop performance, then went on to earn a master's degree in instrumental didactics, which I completed in 2021. My subject: Improvisation to foster learning among young guitarists.",
  "about-2": "I started teaching music during my bachelor's degree in jazz performance. I still love teaching, so if you're looking for a guitar or improvisation teacher, please don't hesitate to ",
  "contact-me": "contact me.",
  "about-3": "My graduate studies introduced me to the world of academic research. I'm still active as a research professional for Jean-Philippe Després (Ph. D.), at Université Laval, as part of his project to research and develop playful teaching materials to support the learning of musical improvisation.",
  "about-4": "Upon completing my Master's degree, I also joined the Canadian Armed Forces as a musician with HMCS Montcalm, a Naval Reserve Division located in Quebec City. Today, I'm mainly active with the National Band of the Naval Reserve, while also being present for HMCS Montcalm's band rehearsals and engagements.",
  "about-5": "When I was finishing my master's degree in instrumental didactics, COVID-19 came along and completely disrupted the research project I was working on. It was impossible to test the analog musical improvisation game with participants who now only saw each other online. It was under this new reality that I migrated the tabletop game developed during the research project to",
  "about-6": ". This enabled us to continue with the project, and gave me a head start in computer science.",
  "about-7": "To expand my knowledge in the field, I enrolled in the computer science certificate program at Université Laval. With my job with the National Band of the Naval Reserve and Jean-Philippe Després' research project, I'm completing my training in slow motion, but it has enabled me to acquire several important skills in the field.",
  "completed-courses": "Completed courses :",
  "python": "Introduction to programming with Python",
  "cpp": "Advanced programming in C++",
  "osa": "Computers: structure and applications",
  "algo": "Algorithms and data structures",
  "about-8": "The highlight of my computer science certificate was an internship at EduMedia. Afterwards, I was lucky enough to be hired as a full-time developer. When I have free time, I spend it on ",
  "my-projects": "my projects",

  "music-desc": "I've been a musician in Quebec City for over 14 years, with a bachelor's degree in jazz/pop performance and a master's degree in instrumental didactics from Université Laval's Faculty of Music.",
  "need-musician": "Need a musician or band for your event?",
  "contact": "Contact me",
  "sheet-music-download": "Sheet music for download",
  "master-recital": "Master's recital",
  "solo-guitar": "Solo guitar",
  "nbnr": "National Band of the Naval Reserve",
  "music-downloads": "Transcriptions, exercises and other scores",
  "need-a-teacher": "Are you looking for a guitar teacher to teach you the following pieces?",
  "transcription-desc": "I made many transcriptions during my music studies, here are some of them, feel free to download and play them!",
  "exercices-desc": "Here are a few exercises that have come in handy as a warm-up and to practice my guitar technique. Documents in french only.",
  "exercice-sweep": "Triad sweep on Tune Up",
  "exercice-arpeggio": "Arpeggio exercises",
  "exercice-neck-hand": "Neck hand exercise",
  "compo-title": "Compositions and arrangements",
  "compo-desc": "If you'd like to learn any of the compositions or arrangements you've heard on this page, here they are!",

  "info-desc": "Specialized in web development, I also enjoy developing video games and utility programs.",
  "work": "I work as a developer at ",
  "work-2": ", and their subsidiary ",
  "web-dev": "Web development",
  "lbf-1": "Laurence bf is an orthopedagogue specializing in French learning difficulties (reading/writing) with children of all ages. She is passionate about helping as many children as possible develop their literacy skills,",
  "lbf-2": "she decided to create the space Laurence bf, orthopedagogue",
  "lbf-3": " to reach out to parents, the most important players in children's lives.",
  "lbf-4": " Her goal is to support and help parents who have questions about how to support their children with French language difficulties.",
  "nbnr-1": "The National Band of the Naval Reserve (NBNR), formed in 1976, is made up of reservist musicians selected from the six Naval Reserve Divisions of Canada that have a band.",
  "nbnr-2": "NBNR trains and performs primarily during the summer to support the Naval Reserve's mission of representing the Canadian Armed Forces and connecting with Canadians.",
  "improvison-1": "Improvison is a research and development project led by Jean-Philippe Després (Ph.D.) that aims to develop pedagogical material based on the principles of learning through play to facilitate the acquisition, by beginner and intermediate instrumentalists, of musical improvisation strategies that are implemented by experts in the field, and to document the perceived impacts of this material.",
  "improvison-2": "",
  "improvison-3": "",
  "cafe-social-1": "Small-scale personal social network for sharing coffee beans, recipes, tips and tricks, etc.",
  "cafe-social-2": "Project under development.",
  "this-website-title": "Jean-Michel Viel, musician, educator and programmer",
  "this-website": "This website!",
  "remplismonordidebits-title": "Fill my computer with bits",
  "remplismonordidebits": "Web application demonstrating the possible need to regulate IndexedDB. ",
  "remplismonordidebits-2": "This site automatically fills your hard disk with irrelevant data, so don't forget to clear your cache!",
  "hrc-title": "Handwriting Character Recognition",
  "hrc-description": "Developed with my colleagues at EduMedia to recognize numbers and the characters <, >, and = drawn on a canvas in a web application for learning mathematics. The algorithm can theoretically recognize any character contained in its dataset.",

  "games-title": "Video games",
  "games-desc": "As part of the Improvison R&D project, directed by Jean-Philippe Després (Ph. D.), I created the game at the heart of the research using Roblox.",
  "dev-pikado": "I was one of the core developers for Pikado. A collection of web applications that make the daily life of primary school teachers easier",
  "dev-alec": "I also develop educational games for their branch ",

  "skills": "Skills :",

  "contact-desc": "Contact me by filling in this form or by sending an e-mail to",
  "contact-desc-head": "Contact me by filling in this form or by sending an e-mail to info@jeanmichelviel.ca",
  "name": "Name",
  "email": "Email",
  "need": "Your needs",
  "select": "-- Select --",
  "musician": "Musician",
  "teacher": "Teacher",
  "web-developper": "Web developper",
  "programmer": "Programmer",
  "message": "Message",
  "send": "Send",
  "modal-title": "Thanks!",
  "modal-desc": "Your message has been sent successfully. I will reply as soon as possible.",
  "modal-close": "Close"
}
